Repository: ojs-services/OJS-email-settings-plugin
Catalog: locale/*/locale.po
Languages: es_es

# plugins.generic.mailSettings.displayName
source: Email Settings Plugin for OJS
es_es: Plugin de Configuración de Correo para OJS

# plugins.generic.mailSettings.description
source: Manage email delivery settings (SMTP, PHP mail, Sendmail) from the OJS admin panel without editing config.inc.php. Supports per-journal SMTP configuration, service presets (Gmail, Office 365, Yandex), and test email functionality.
es_es: Gestione la configuración de envío de correo (SMTP, PHP mail, Sendmail) desde el panel de administración de OJS sin editar config.inc.php. Soporta configuración SMTP por revista, ajustes preestablecidos de servicios (Gmail, Office 365, Yandex) y funcionalidad de correo de prueba.

# plugins.generic.mailSettings.sidebar.label
source: Email Settings
es_es: Configuración de Correo

# plugins.generic.mailSettings.status.label
source: Current Status
es_es: Estado Actual

# plugins.generic.mailSettings.status.default
source: Using OJS Default Configuration (config.inc.php)
es_es: Usando la configuración predeterminada de OJS (config.inc.php)

# plugins.generic.mailSettings.status.custom
source: Using Custom Mail Settings
es_es: Usando configuración de correo personalizada

# plugins.generic.mailSettings.settingsSaved
source: Mail settings saved successfully.
es_es: Configuración de correo guardada con éxito.

# plugins.generic.mailSettings.configSource.title
source: Mail Configuration Source
es_es: Origen de la configuración de correo

# plugins.generic.mailSettings.configSource.default
source: Use OJS Default Configuration
es_es: Usar la configuración predeterminada de OJS

# plugins.generic.mailSettings.configSource.defaultDesc
source: Mail settings from your config.inc.php file will be used. To change these settings, you need server access (FTP/SSH) or contact your system administrator.
es_es: Se utilizará la configuración de correo de su archivo config.inc.php. Para cambiar esta configuración, necesita acceso al servidor (FTP/SSH) o contactar a su administrador del sistema.

# plugins.generic.mailSettings.configSource.custom
source: Use Custom Mail Settings
es_es: Usar configuración de correo personalizada

# plugins.generic.mailSettings.configSource.customDesc
source: Configure mail delivery settings from this panel. These settings will override your config.inc.php mail configuration. If you disable the plugin or clear these settings, the system will automatically fall back to config.inc.php defaults.
es_es: Configure los ajustes de envío de correo desde este panel. Estos ajustes anularán la configuración de correo de config.inc.php. Si desactiva el plugin o borra estos ajustes, el sistema volverá automáticamente a los valores predeterminados de config.inc.php.

# plugins.generic.mailSettings.mailMethod.title
source: Mail Delivery Method
es_es: Método de envío de correo

# plugins.generic.mailSettings.mailMethod.smtp
source: SMTP (Recommended)
es_es: SMTP (Recomendado)

# plugins.generic.mailSettings.presets.title
source: Quick Setup — Service Presets
es_es: Configuración Rápida — Ajustes Preestablecidos

# plugins.generic.mailSettings.presets.description
source: Select your email service provider for auto-configuration, or choose "Custom SMTP" to enter settings manually.
es_es: Seleccione su proveedor de servicio de correo electrónico para la autoconfiguración, o elija "SMTP Personalizado" para introducir los ajustes manualmente.

# plugins.generic.mailSettings.presets.manual
source: Enter manually
es_es: Introducir manualmente

# plugins.generic.mailSettings.preset.gmail.note
source: Gmail requires an App Password instead of your regular password. Enable 2-Step Verification first.
es_es: Gmail requiere una Contraseña de Aplicación en lugar de su contraseña habitual. Active primero la Verificación en dos pasos.

# plugins.generic.mailSettings.preset.office365.note
source: Office 365 requires SMTP AUTH to be enabled for the mailbox.
es_es: Office 365 requiere que SMTP AUTH esté habilitado para el buzón de correo.

# plugins.generic.mailSettings.smtp.title
source: SMTP Server Settings
es_es: Configuración del Servidor SMTP

# plugins.generic.mailSettings.smtp.server
source: SMTP Server
es_es: Servidor SMTP

# plugins.generic.mailSettings.smtp.port
source: SMTP Port
es_es: Puerto SMTP

# plugins.generic.mailSettings.smtp.encryption
source: Encryption
es_es: Cifrado

# plugins.generic.mailSettings.smtp.noEncryption
source: None (Not Recommended)
es_es: Ninguno (No recomendado)

# plugins.generic.mailSettings.smtp.authType
source: Authentication Type
es_es: Tipo de Autenticación

# plugins.generic.mailSettings.smtp.authTypeAuto
source: Auto Detect
es_es: Detección Automática

# plugins.generic.mailSettings.credentials.title
source: Authentication
es_es: Autenticación

# plugins.generic.mailSettings.smtp.username
source: SMTP Username
es_es: Nombre de usuario SMTP

# plugins.generic.mailSettings.smtp.password
source: SMTP Password
es_es: Contraseña SMTP

# plugins.generic.mailSettings.smtp.passwordUnchanged
source: •••••••• (unchanged)
es_es: •••••••• (sin cambios)

# plugins.generic.mailSettings.smtp.passwordEnter
source: Enter password
es_es: Introducir contraseña

# plugins.generic.mailSettings.smtp.passwordSet
source: Password is set
es_es: La contraseña está configurada

# plugins.generic.mailSettings.smtp.showPassword
source: 👁 Show
es_es: 👁 Mostrar

# plugins.generic.mailSettings.advanced.title
source: Advanced Settings
es_es: Configuración Avanzada

# plugins.generic.mailSettings.advanced.envelopeSender
source: Default Envelope Sender
es_es: Remitente de sobre predeterminado (Envelope Sender)

# plugins.generic.mailSettings.advanced.envelopeSenderDesc
source: The bounce address for undelivered emails. Usually the same as your SMTP username.
es_es: La dirección de rebote para correos electrónicos no entregados. Por lo general, es la misma que su nombre de usuario SMTP.

# plugins.generic.mailSettings.advanced.forceEnvelope
source: Force default envelope sender for all outgoing emails
es_es: Forzar remitente del sobre predeterminado para todos los correos salientes

# plugins.generic.mailSettings.advanced.dmarcCompliant
source: Force DMARC compliant "From" header
es_es: Forzar encabezado "From" compatible con DMARC

# plugins.generic.mailSettings.advanced.dmarcDisplayName
source: DMARC Display Name Format
es_es: Formato de nombre para mostrar de DMARC

# plugins.generic.mailSettings.advanced.dmarcDisplayNameDesc
source: Use %n for user name, %s for site name. Example: "%n via %s"
es_es: Use %n para el nombre de usuario, %s para el nombre del sitio. Ejemplo: "%n vía %s"

# plugins.generic.mailSettings.advanced.suppressCert
source: Suppress SMTP SSL certificate verification
es_es: Suprimir verificación del certificado SSL del SMTP

# plugins.generic.mailSettings.advanced.notRecommended
source: Not recommended
es_es: No recomendado

# plugins.generic.mailSettings.test.title
source: Test Email
es_es: Correo de Prueba

# plugins.generic.mailSettings.test.description
source: Send a test email to verify your mail settings are working correctly. Make sure to save your settings first before testing.
es_es: Envíe un correo electrónico de prueba para verificar que la configuración de correo funcione correctamente. Asegúrese de guardar su configuración primero antes de realizar la prueba.

# plugins.generic.mailSettings.test.emailLabel
source: Recipient Email Address
es_es: Dirección de Correo Electrónico del Destinatario

# plugins.generic.mailSettings.test.send
source: Send Test Email
es_es: Enviar Correo de Prueba

# plugins.generic.mailSettings.test.invalidEmail
source: Please enter a valid email address.
es_es: Por favor, introduzca una dirección de correo electrónico válida.

# plugins.generic.mailSettings.test.usingDefault
source: Using OJS default configuration (config.inc.php)...
es_es: Usando configuración predeterminada de OJS (config.inc.php)...

# plugins.generic.mailSettings.test.usingPhpMail
source: Using PHP mail() function...
es_es: Usando función mail() de PHP...

# plugins.generic.mailSettings.test.usingSendmail
source: Using Sendmail...
es_es: Usando Sendmail...

# plugins.generic.mailSettings.test.connecting
source: Connecting to {$server}:{$port}...
es_es: Conectando a {$server}:{$port}...

# plugins.generic.mailSettings.test.authenticating
source: Authenticating...
es_es: Autenticando...

# plugins.generic.mailSettings.test.authSuccess
source: Authentication successful.
es_es: Autenticación exitosa.

# plugins.generic.mailSettings.test.sendSuccess
source: Test email sent successfully to {$email}.
es_es: Correo electrónico de prueba enviado exitosamente a {$email}.

# plugins.generic.mailSettings.test.allPassed
source: All tests passed. Your mail settings are working correctly.
es_es: Todas las pruebas pasaron. Su configuración de correo funciona correctamente.

# plugins.generic.mailSettings.test.failed
source: Test failed. Please check your settings and try again.
es_es: La prueba falló. Por favor, compruebe su configuración e inténtelo de nuevo.

# plugins.generic.mailSettings.test.phpmailerNotFound
source: PHPMailer library not found. Please check your OJS installation.
es_es: No se encontró la librería PHPMailer. Por favor, compruebe su instalación de OJS.

# plugins.generic.mailSettings.test.subject
source: [{$siteName}] Mail Settings Test
es_es: [{$siteName}] Prueba de Configuración de Correo

# plugins.generic.mailSettings.test.emailTitle
source: Mail Settings Test - Successful
es_es: Prueba de Configuración de Correo - Exitosa

# plugins.generic.mailSettings.test.emailBody
source: This is a test email from {$siteName}. If you received this email, your mail settings are configured correctly.
es_es: Este es un correo electrónico de prueba de {$siteName}. Si recibió este correo electrónico, su configuración de correo está configurada correctamente.

# plugins.generic.mailSettings.test.bodyPlain
source: This is a test email from {$siteName}. If you received this email, your mail settings are configured correctly.
es_es: Este es un correo electrónico de prueba de {$siteName}. Si recibió este correo electrónico, su configuración de correo está configurada correctamente.

# plugins.generic.mailSettings.test.method
source: Method
es_es: Método

# plugins.generic.mailSettings.test.server
source: Server
es_es: Servidor

# plugins.generic.mailSettings.test.time
source: Sent at
es_es: Enviado a las

# plugins.generic.mailSettings.test.footer
source: This email was sent by the Mail Settings plugin for testing purposes.
es_es: Este correo ha sido enviado por el plugin de Configuración de Correo con fines de prueba.

# plugins.generic.mailSettings.test.suggestion.gmail
source: Gmail requires an App Password (16 characters) instead of your regular password. Enable 2-Step Verification in your Google Account first, then generate an App Password.
es_es: Gmail requiere una Contraseña de Aplicación (16 caracteres) en lugar de su contraseña habitual. Active primero la Verificación en dos pasos en su Cuenta de Google, y luego genere una Contraseña de Aplicación.

# plugins.generic.mailSettings.test.suggestion.office365
source: Office 365 may require SMTP AUTH to be enabled in the Exchange admin center. Multi-Factor Authentication (MFA) may also require an App Password.
es_es: Office 365 puede requerir que SMTP AUTH se habilite en el centro de administración de Exchange. La Autenticación Multifactor (MFA) también puede requerir una Contraseña de Aplicación.

# plugins.generic.mailSettings.test.suggestion.auth
source: Please check your username and password. Make sure the credentials are correct for your SMTP server.
es_es: Por favor, compruebe su nombre de usuario y contraseña. Asegúrese de que las credenciales sean correctas para su servidor SMTP.

# plugins.generic.mailSettings.test.suggestion.connection
source: Could not connect to the SMTP server. Please check the server address and port. Your hosting provider or firewall may be blocking outgoing connections on this port.
es_es: No se pudo conectar al servidor SMTP. Por favor, compruebe la dirección del servidor y el puerto. Su proveedor de hosting o cortafuegos podría estar bloqueando las conexiones salientes en este puerto.

# plugins.generic.mailSettings.test.suggestion.ssl
source: SSL/TLS certificate verification failed. You can try enabling "Suppress SSL certificate verification" in Advanced Settings, but this is not recommended for production use.
es_es: La verificación del certificado SSL/TLS falló. Puede intentar habilitar "Suprimir verificación del certificado SSL" en Configuración Avanzada, pero esto no se recomienda para uso en producción.

# plugins.generic.mailSettings.error.noAccess
source: You do not have permission to access mail settings.
es_es: No tiene permiso para acceder a la configuración de correo.

# plugins.generic.mailSettings.error.smtpServerRequired
source: SMTP server address is required when using custom SMTP settings.
es_es: La dirección del servidor SMTP es obligatoria cuando se usa la configuración SMTP personalizada.

# plugins.generic.mailSettings.error.csrf
source: Security token expired. Please refresh the page and try again.
es_es: Token de seguridad expirado. Por favor, actualice la página e inténtelo de nuevo.

# plugins.generic.mailSettings.error.invalidEnvelopeSender
source: Envelope sender must be a valid email address.
es_es: El remitente del sobre (Envelope Sender) debe ser una dirección de correo electrónico válida.

# plugins.generic.mailSettings.test.rateLimited
source: Please wait {$seconds} seconds before sending another test email.
es_es: Por favor, espere {$seconds} segundos antes de enviar otro correo electrónico de prueba.

# plugins.generic.mailSettings.deliverability.title
source: Email Deliverability Recommendations
es_es: Recomendaciones de Entregabilidad de Correos

# plugins.generic.mailSettings.deliverability.intro
source: To ensure emails reach recipients and avoid spam folders, ask your server administrator or hosting provider to configure the following DNS records for your domain:
es_es: Para asegurar que los correos lleguen a los destinatarios y evitar las carpetas de spam, pida a su administrador de servidor o proveedor de hosting que configure los siguientes registros DNS para su dominio:

# plugins.generic.mailSettings.deliverability.spf
source: Authorizes your SMTP server to send emails on behalf of your domain. Without SPF, receiving servers may reject or flag your emails.
es_es: Autoriza a su servidor SMTP a enviar correos en nombre de su dominio. Sin SPF, los servidores receptores pueden rechazar o marcar sus correos.

# plugins.generic.mailSettings.deliverability.dkim
source: Adds a digital signature to outgoing emails, proving they were not altered in transit. Significantly improves inbox delivery rates.
es_es: Añade una firma digital a los correos salientes, demostrando que no fueron alterados en tránsito. Mejora significativamente las tasas de entrega en la bandeja de entrada.

# plugins.generic.mailSettings.deliverability.dmarc
source: Tells receiving servers how to handle emails that fail SPF/DKIM checks. Protects your domain from spoofing and phishing.
es_es: Indica a los servidores receptores cómo manejar los correos que fallan las comprobaciones SPF/DKIM. Protege su dominio contra la suplantación de identidad (spoofing) y phishing.

# plugins.generic.mailSettings.deliverability.note
source: These settings are configured at the DNS level by your domain/hosting provider, not within OJS. If you use a service like Gmail or Yandex for SMTP, their documentation provides the required DNS records. Contact your server administrator for assistance.
es_es: Estos ajustes se configuran a nivel DNS por su proveedor de dominio/hosting, no dentro de OJS. Si utiliza un servicio como Gmail o Yandex para SMTP, su documentación proporciona los registros DNS requeridos. Contacte a su administrador de servidor para obtener ayuda.

# plugins.generic.mailSettings.stats.today
source: today
es_es: hoy

# plugins.generic.mailSettings.stats.week
source: 7 days
es_es: 7 días

# plugins.generic.mailSettings.stats.month
source: 30 days
es_es: 30 días

# plugins.generic.mailSettings.stats.todayTip
source: Emails sent today via this plugin
es_es: Correos enviados hoy mediante este plugin

# plugins.generic.mailSettings.stats.weekTip
source: Emails sent in the last 7 days
es_es: Correos enviados en los últimos 7 días

# plugins.generic.mailSettings.stats.monthTip
source: Emails sent in the last 30 days
es_es: Correos enviados en los últimos 30 días

# plugins.generic.mailSettings.stats.note
source: Only tracks emails sent via custom mail settings
es_es: Solo rastrea los correos enviados a través de la configuración de correo personalizada
